app/controllers/admin/reservations_controller.rb

  def index
    @page_title = "Admin Panel: All Reservations"
    @reservations = Reservation.all
    @countries = Country.all
    @cities = City.all
    @reservation_types = ReservationType.all
    @meal_types = MealType.all
    @spice_levels = SpiceLevel.all
---
SELECT "reservations".* FROM "reservations"
SELECT "countries".* FROM "countries"
SELECT "cities".* FROM "cities"
SELECT "meal_types".* FROM "meal_types"
SELECT "reservation_types".* FROM "reservation_types"
SELECT "spice_levels".* FROM "spice_levels"