app/views/reservations/_form.html.erb

SELECT "countries".* FROM "countries"
---
        </div>
        <%= f.select :country, options_from_collection_for_select(@countries, 'id', 'name') %>

SELECT "cities".* FROM "cities"
---
        </div>
        <%= f.select :city, options_from_collection_for_select(@cities, 'id', 'name') %>