app/controllers/reservations_controller.rb

  def new
    @page_title = "Concierge Service"
    @reservation = Reservation.new
    @countries = Country.all
    @cities = City.all
    @reservation_types = ReservationType.all
    @meal_types = MealType.all
    @spice_levels = SpiceLevel.all
---
SELECT "countries".* FROM "countries"
SELECT "cities".* FROM "cities"
SELECT  "reservation_types".* FROM "reservation_types"   ORDER BY "reservation_types"."id" ASC LIMIT 1
SELECT "meal_types".* FROM "meal_types"
SELECT "spice_levels".* FROM "spice_levels"

  def create
    @reservation = Reservation.new(reservation_params)
    respond_to do |format|
      if @reservation.save
---
INSERT INTO "reservations" ("additional_dates", "alchohol", "allergies", "allergies_text", "cities_id", "drinks", "number_of_guests", "reservation_types_id", "spice_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"  [["additional_dates", ""], ["alchohol", "f"], ["allergies", "f"], ["allergies_text", ""], ["cities_id", 0], ["drinks", 0], ["number_of_guests", 0], ["reservation_types_id", 1], ["spice_id", 1]]